In [4]:
%load_ext sql

In [5]:
import sqlalchemy

In [6]:
%sql mysql://root:root@localhost

In [7]:
%%sql 

create schema q_1479;
use q_1479;

Create table If Not Exists Orders (order_id int, customer_id int, order_date date, item_id varchar(30), quantity int);
Create table If Not Exists Items (item_id varchar(30), item_name varchar(30), item_category varchar(30));
Truncate table Orders;
insert into Orders (order_id, customer_id, order_date, item_id, quantity) values ('1', '1', '2020-06-01', '1', '10');
insert into Orders (order_id, customer_id, order_date, item_id, quantity) values ('2', '1', '2020-06-08', '2', '10');
insert into Orders (order_id, customer_id, order_date, item_id, quantity) values ('3', '2', '2020-06-02', '1', '5');
insert into Orders (order_id, customer_id, order_date, item_id, quantity) values ('4', '3', '2020-06-03', '3', '5');
insert into Orders (order_id, customer_id, order_date, item_id, quantity) values ('5', '4', '2020-06-04', '4', '1');
insert into Orders (order_id, customer_id, order_date, item_id, quantity) values ('6', '4', '2020-06-05', '5', '5');
insert into Orders (order_id, customer_id, order_date, item_id, quantity) values ('7', '5', '2020-06-05', '1', '10');
insert into Orders (order_id, customer_id, order_date, item_id, quantity) values ('8', '5', '2020-06-14', '4', '5');
insert into Orders (order_id, customer_id, order_date, item_id, quantity) values ('9', '5', '2020-06-21', '3', '5');
Truncate table Items;
insert into Items (item_id, item_name, item_category) values ('1', 'LC Alg. Book', 'Book');
insert into Items (item_id, item_name, item_category) values ('2', 'LC DB. Book', 'Book');
insert into Items (item_id, item_name, item_category) values ('3', 'LC SmarthPhone', 'Phone');
insert into Items (item_id, item_name, item_category) values ('4', 'LC Phone 2020', 'Phone');
insert into Items (item_id, item_name, item_category) values ('5', 'LC SmartGlass', 'Glasses');
insert into Items (item_id, item_name, item_category) values ('6', 'LC T-Shirt XL', 'T-shirt');

 * mysql://root:***@localhost
1 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [8]:
%%sql 
select * from Orders;

 * mysql://root:***@localhost
9 rows affected.

[(1, 1, datetime.date(2020, 6, 1), '1', 10),
 (2, 1, datetime.date(2020, 6, 8), '2', 10),
 (3, 2, datetime.date(2020, 6, 2), '1', 5),
 (4, 3, datetime.date(2020, 6, 3), '3', 5),
 (5, 4, datetime.date(2020, 6, 4), '4', 1),
 (6, 4, datetime.date(2020, 6, 5), '5', 5),
 (7, 5, datetime.date(2020, 6, 5), '1', 10),
 (8, 5, datetime.date(2020, 6, 14), '4', 5),
 (9, 5, datetime.date(2020, 6, 21), '3', 5)]

In [11]:
%%sql 
select * from items;

 * mysql://root:***@localhost
6 rows affected.

[('1', 'LC Alg. Book', 'Book'),
 ('2', 'LC DB. Book', 'Book'),
 ('3', 'LC SmarthPhone', 'Phone'),
 ('4', 'LC Phone 2020', 'Phone'),
 ('5', 'LC SmartGlass', 'Glasses'),
 ('6', 'LC T-Shirt XL', 'T-shirt')]

Table: Orders

+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| order_id      | int     |
| customer_id   | int     |
| order_date    | date    | 
| item_id       | varchar |
| quantity      | int     |
+---------------+---------+
(ordered_id, item_id) is the primary key for this table.
This table contains information of the orders placed.
order_date is the date when item_id was ordered by the customer with id customer_id.
 

Table: Items

+---------------------+---------+
| Column Name         | Type    |
+---------------------+---------+
| item_id             | varchar |
| item_name           | varchar |
| item_category       | varchar |
+---------------------+---------+
item_id is the primary key for this table.
item_name is the name of the item.
item_category is the category of the item.

You are the business owner and would like to obtain a sales report for category items and day of the week.

Write an SQL query to report how many units in each category have been ordered on each day of the week.
Return the result table ordered by category.

In [14]:
%%sql

SELECT DAYOFWEEK(order_date) 

FROM orders

 * mysql://root:***@localhost
9 rows affected.

[(2,), (2,), (3,), (4,), (5,), (6,), (6,), (1,), (1,)]

In [61]:
%%sql 
SELECT i.item_category as 'Category', dayofweek(o.order_date) as 'dayofweek',sum(o.quantity) 'units' 
FROM Items i
LEFT JOIN Orders o
ON i.item_id = o.item_id 
GROUP BY i.item_category, dayofweek(o.order_date)
ORDER BY i.item_category

 * mysql://root:***@localhost
8 rows affected.

[('Book', 2, Decimal('20')),
 ('Book', 3, Decimal('5')),
 ('Book', 6, Decimal('10')),
 ('Glasses', 6, Decimal('5')),
 ('Phone', 1, Decimal('10')),
 ('Phone', 4, Decimal('5')),
 ('Phone', 5, Decimal('1')),
 ('T-shirt', None, None)]

In [78]:
%%sql 

/*
1) Join the two tables in order to get all the information of the tables in one place. join key on item_id
2) We want: (i)  each category (item_category) 
            (ii) each day(dayofweek(order_date)) 
            (iii) how many units? (sum(quantity)) 
*/


with cte as (
SELECT i.item_category as 'CATEGORY', dayofweek(o.order_date) as 'dayofweek', 
CASE WHEN sum(o.quantity) THEN sum(o.quantity) ELSE 0 end as 'units' 
FROM Items i
LEFT JOIN Orders o
ON i.item_id = o.item_id 
GROUP BY i.item_category, dayofweek(o.order_date)
ORDER BY i.item_category),


cte2 as (SELECT CATEGORY,
CASE WHEN dayofweek = 2 THEN units else 0 end as 'Monday',
CASE WHEN dayofweek = 3 THEN units else 0 end as 'Tuesday',
CASE WHEN dayofweek = 4 THEN units else 0 end as 'Wednesday',
CASE WHEN dayofweek = 5 THEN units else 0 end as 'Thrusday',
CASE WHEN dayofweek = 6 THEN units else 0 end as 'Friday',
CASE WHEN dayofweek = 7 THEN units else 0 end as 'Saturday',
CASE WHEN dayofweek = 1 THEN units else 0 end as 'Sunday'
FROM cte)

select Category as CATEGORY, sum(Monday) as MONDAY, sum(Tuesday) as TUESDAY, sum(Wednesday) as WEDNESDAY,
sum(Thrusday) as THURSDAY, sum(Friday) as FRIDAY, sum(Saturday) as SATURDAY, sum(Sunday) as SUNDAY
FROM cte2
GROUP BY Category

 * mysql://root:***@localhost
4 rows affected.

[('Book', Decimal('20'), Decimal('5'), Decimal('0'), Decimal('0'), Decimal('10'), Decimal('0'), Decimal('0')),
 ('Glasses', Decimal('0'), Decimal('0'), Decimal('0'), Decimal('0'), Decimal('5'), Decimal('0'), Decimal('0')),
 ('Phone', Decimal('0'), Decimal('0'), Decimal('5'), Decimal('1'), Decimal('0'), Decimal('0'), Decimal('10')),
 ('T-shirt', Decimal('0'), Decimal('0'), Decimal('0'), Decimal('0'), Decimal('0'), Decimal('0'), Decimal('0'))]